public class Main {
    public static void main(String[] args) {
        String[][] array = {
                { "A", "B" },
                { "C" },
                { "D", "E", "F", "G" }
        };
        for (int i = 0; i < array.length; i++) {
            int j = 0;
            for (; j < array[i].length; j++) {
                System.out.println("[" + i + ", " + j + "] = " + array[i][j]);
            }
        }
    }
}
// 56. 次のプログラムをコンパイルし、実行したときの結果として、正しいものを選びなさい（１つ選択）。
// A.
// [0, 0] = A
// [0, 1] = B
// [1, 0] = C
// [1, 1] = D
// [2, 0] = E
// [2, 1] = F
// [2, 2] = G
//
// B.
// [0, 0] = A
// [0, 1] = B
// [1, 0] = C
// [2, 0] = D
// [2, 1] = E
// [2, 2] = F
// [2, 3] = G
//
// C.
// [0, 0] = A
// [0, 1] = B
// [1, 0] = C
// [1, 1] = D
// [2, 1] = E
// [2, 2] = F
// [2, 3] = G
//
// D.
// [0, 0] = A
// [0, 1] = B
// [0, 2] = C
// [1, 0] = D
// [1, 1] = E
// [1, 2] = F
// [1, 3] = G
//
// Ans B.